In [1]:
from __future__ import print_function

import mysql.connector
from mysql.connector import errorcode

import os
import pandas as pd

#### Fetch credentials

In [2]:
d = {}

cwd = os.getcwd()
file_path = cwd + '/../mysql/creds.txt'

with open(file_path, 'r') as f:
    for l in f.readlines(): d[l.split()[0]] = l.split()[1]

### Create project database

In [3]:
conn = mysql.connector.connect(user=d['user'], password=d['pw'])
cur = conn.cursor()

DB_NAME = 'bi_project'

In [4]:
def create_database(cursor):
    try:
        cursor.execute(
            "CREATE DATABASE {} DEFAULT CHARACTER SET 'utf8'".format(DB_NAME))
    except mysql.connector.Error as err:
        print("Failed creating database: {}".format(err))
        exit(1)
try:
    cur.execute("USE {}".format(DB_NAME))
except mysql.connector.Error as err:
    print("Database {} does not exists.".format(DB_NAME))
    if err.errno == errorcode.ER_BAD_DB_ERROR:
        create_database(cur)
        print("Database {} created successfully.".format(DB_NAME))
        conn.database = DB_NAME
    else:
        print(err)
        exit(1)

In [5]:
query = """
    drop table if exists Dim_Municipality
"""
cur.execute(query)

query = """
    create table Dim_Municipality (
        loc_id int not null,
        municipality varchar(20) not null,
        primary key(loc_id)
    )
"""
cur.execute(query)

query = f"""
    load data infile '{cwd}//src//municipalities//loc_id_municipality.csv'
    into table Dim_Municipality
    fields terminated by ',' 
    enclosed by '"'
    lines terminated by '\r\n'
    ignore 1 rows
    """
cur.execute(query)

In [6]:
query = """
    select *
    from Dim_Municipality
    limit 3
"""
pd.read_sql(query, conn)

   loc_id municipality
0       0     Grimstad
1       1      Arendal
2       2     Birkenes

In [7]:
query = """
    drop table if exists Municipality_Nearest_Station
"""
cur.execute(query)

query = """
    create table Municipality_Nearest_Station (
        municipality varchar(20) not null,
        nearest_station varchar(20) not null,
        primary key(municipality)
    )
"""
cur.execute(query)

query = f"""
    load data infile '{cwd}//src//municipalities//municipality_nearest_station.csv'
    into table Municipality_Nearest_Station
    fields terminated by ',' 
    enclosed by '"'
    lines terminated by '\r\n'
    ignore 1 rows
    """
cur.execute(query)

In [8]:
query = """
    select *
    from Municipality_Nearest_Station
    limit 3
"""
pd.read_sql(query, conn)

  municipality nearest_station
0      Arendal         SN36200
1     Birkenes         SN39040
2      Bygland         SN39750

Gather all elspotprices

In [9]:
query = """
    drop table if exists Dim_Elspot
"""
cur.execute(query)

query = """
    create table Dim_Elspot (
        time datetime not null,
        price varchar(10),
        
        primary key(time)
    )
"""
cur.execute(query)

In [10]:
folder = f'{cwd}//src//elspot_prices//'
for file in os.listdir(folder):
    if file.split('.')[-1] != 'csv': continue
        
    query = f"""
        load data infile '{folder}{file}'
        into table Dim_Elspot
        fields terminated by ',' 
        enclosed by '"'
        lines terminated by '\r\n'
        ignore 1 rows
    """
    cur.execute(query)

In [11]:
query = """
    select *
    from Dim_Elspot
    limit 3
"""
pd.read_sql(query, conn)

                 time   price
0 2018-01-01 00:00:00  258,01
1 2018-01-01 01:00:00  258,99
2 2018-01-01 02:00:00  255,75

In [12]:
query = """
    select 
        extract(year from time) as year,
        count(*) as count
    from Dim_Elspot
    group by year
"""
pd.read_sql(query, conn).T

          0     1     2
year   2018  2019  2020
count  8760  8760  3000

In [13]:
query = """
    drop table if exists Dim_Oilspot
"""
cur.execute(query)

query = """
    create table Dim_Oilspot(
        day date not null,
        price varchar(10),
        primary key(day)
    )
"""
cur.execute(query)

In [14]:
query = f"""
    load data infile '{cwd}//src//oilspot_prices//Brent_oilspot_prices.csv'
    into table Dim_Oilspot
    fields terminated by ',' 
    enclosed by '"'
    lines terminated by '\r\n'
    ignore 1 rows
"""
cur.execute(query)

In [15]:
query = """
    select *
    from Dim_Oilspot
    where day like '%2020-01%'
    limit 5
"""
pd.read_sql(query, conn)

          day  price
0  2020-01-01  67.77
1  2020-01-02  67.05
2  2020-01-03  69.08
3  2020-01-06  70.25
4  2020-01-07  68.74

In [16]:
query = """
    select
        extract(year from day) as year,
        count(*) as count
    from Dim_Oilspot
    group by year
"""
pd.read_sql(query, conn).T

,0,1,2,3,4,5,6,7,8,9,...,24,25,26,27,28,29,30,31,32,33
year,1987,1988,1989,1990,1991,1992,1993,1994,1995,1996,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
count,160,255,254,256,257,257,252,252,253,254,...,248,250,252,251,257,256,256,254,259,84

In [17]:
query = """
    drop table if exists Exchange_Rates
"""
cur.execute(query)

query = """
    create temporary table Exchange_Rates(
        day varchar(20) not null,
        usd varchar(10),
        eur varchar(10),
        sek varchar(10),
        dkk varchar(10),
        gbp varchar(10),
        chf varchar(10),
        jpy varchar(10),
        cad varchar(10),
        isk varchar(10),
        aud varchar(10),
        primary key(day)
    )
"""
cur.execute(query)

In [18]:
folder = f'{cwd}//src//exchange_rates//'
for file in os.listdir(folder):
    if file.split('.')[-1] != 'csv': continue
    query = f"""
        load data infile '{folder}{file}'
        into table Exchange_Rates
        fields terminated by ',' 
        enclosed by '"'
        lines terminated by '\r\n'
        ignore 1 rows
    """
    cur.execute(query)

In [19]:
query = """
    select *
    from Exchange_Rates
    limit 3
"""
pd.read_sql(query, conn)

,day,usd,eur,sek,dkk,gbp,chf,jpy,cad,isk,aud
0,01.02.2018,7.7079,9.5605,97.61,128.46,10.9483,826.05,7.034,6.2567,7.6612,6.1771
1,01.02.2019,8.436,9.6571,93.2,129.36,11.0588,848.44,7.7451,6.4169,7.0195,6.1136
2,01.03.2018,7.8968,9.6353,95.35,129.39,10.8613,835.64,7.3947,6.1538,7.7889,6.1019

In [20]:
query = """
    drop table if exists Dim_USD_NOK
"""
cur.execute(query)

query = """
    create table Dim_USD_NOK as(
        select
            str_to_date(day, '%d.%m.%Y') as day,
            usd as price_1_USD
        from Exchange_Rates
        order by day asc
    )
"""
cur.execute(query)

In [21]:
query = """
    select *
    from Dim_USD_NOK
    limit 5
"""
pd.read_sql(query, conn)

          day price_1_USD
0  2018-01-02      8.1435
1  2018-01-03      8.1416
2  2018-01-04      8.1022
3  2018-01-05      8.0835
4  2018-01-08      8.0768

In [22]:
query = """
    drop table if exists Belastning_Gathered
"""
cur.execute(query)

query = """
    create temporary table Belastning_Gathered (
        a varchar(10),
        time datetime not null,
        consumption_kvah varchar(20),
        upper_tol_kvah varchar(10),
        upper_tol_p20 varchar(10),
        loc_id int not null,
        primary key(time, loc_id)
    )
"""
cur.execute(query)

In [23]:
folder = f'{cwd}//src//belastning_nettstasjon//'
for file in os.listdir(folder):
    if file.split('.')[-1] != 'csv': continue
    file_path = os.path.join(folder, file)

    query = f"""
        load data infile '{file_path}'
        into table Belastning_Gathered
        fields terminated by ',' 
        enclosed by '"'
        lines terminated by '\r\n'
        ignore 1 rows
    """
    cur.execute(query)

In [24]:
query = """
    drop table if exists Dim_Transformer
"""
cur.execute(query)

query = """
    create table Dim_Transformer as (
        select 
            distinct(loc_id),
            upper_tol_kvah
        from Belastning_Gathered
    )
"""
cur.execute(query)

query = """
    alter table Dim_Transformer
    add primary key(loc_id)
"""
cur.execute(query)

In [25]:
query = """
    select *
    from Dim_Transformer
    order by loc_id
"""
pd.read_sql(query, conn).T

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
loc_id,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
upper_tol_kvah,100,1000,100,100,500,500,100,1250,200,500,50,100,800,800,100,50,100,100,315,200

Import weather reports either as `.json` files or run the last bit of preprocessing in `frost_api_to_json.ipynb` to convert them to `.csv` files instead.

The following cell will (on my computer at least) demand of you 33 hours of waiting. The mentioned preprocessing takes about 40 minutes. Better do that and skip this cell.

#### Alternative 1: Load `.json` files into weather table

In [26]:
# from time import time
# 
# query = """
#     drop table if exists jsonTable
# """
# cur.execute(query)
# 
# query = """
#     create temporary table jsonTable ( 
#         jsonFile json
#     )
# """
# cur.execute(query)
# 
# # For every .json file in folder...
# folder = 'D://_bi//src//weather_jsons//'
# for file in os.listdir(folder):
#     if file.split('.')[-1] != 'json': continue
#     file_path = os.path.join(folder, file)
# 
#     # Save the file content in variable @jsonData
#     query = f"""
#         load data infile '{file_path}'
#         into table jsonTable
#         fields terminated by '\0' escaped by ''
#         lines terminated by '\0'
#         (@jsonData)
#     """
#     cur.execute(query)
#     
#     # The data contains a time series of length n
#     query = """
#         select json_length(json_extract(@jsonData, '$.data')) 
#     """
#     cur.execute(query)
#     n = cur.fetchall()[0][0]
#     
#     tic = time()
#     print(f'Rows of {file} loaded into table'.rjust(20), 'Mins elapsed'.rjust(20), 'Estimated minutes left'.rjust(30))
# 
#     # For every i = (0, 1,..., n-1) in @jsonData's data[i] array
#     # Store the ith timestamp, weather_station id, and temperature measurement
#     for i in range(n):
#         query = f"""
#             insert into Dim_Weather (time, weather_station, temp)
# 
#             with a as(
#                 select json_extract(@jsonData, '$.data[{i}].sourceId') as ws
#             ), b as (
#                 select substring(a.ws, 2, char_length(a.ws) - 4) as ws_trimmed
#                 from a
#             ), c as (
#                 select json_extract(@jsonData, '$.data[{i}].referenceTime') as rt
#             ), d as (
#                 select substring(c.rt, 2, char_length(c.rt) - 7) as rt_trimmed
#                 from c
#             ), e as (
#                 select replace(d.rt_trimmed, 'T', ' ') as time
#                 from d
#             ), f as (
#                 select json_extract(@jsonData, '$.data[{i}].observations[0].value') as temp
#             )
#             select
#                 e.time,
#                 b.ws_trimmed,
#                 f.temp
#             from
#                 e, b, f   
#         """
#         cur.execute(query)
#         
#         # Every 10 rows, print a status update
#         if not i % 10: 
#             toc = time()
#             print(f'{i}/{n}'.rjust(0), f'{(toc-tic)/60:.2f}'.rjust(42), f'{(n/(i+1) * (toc-tic) - (toc-tic))/60 :.2f}'.rjust(22), end='\r')
#             
#     print(f'Loaded file {file} into Dim_Weather')

#### Alternative 2: Preprocess `.json` files to `.csv` in `frost_api_to_json.ipynb` and load `.csv` files into weather table

In [27]:
query = """
    drop table if exists Weather_Gathered
"""
cur.execute(query)

query = """
    create temporary table Weather_Gathered (
        a int,
        b int, 
        element_id varchar(30),
        c int,
        level varchar(70),
        perf varchar(2),
        d int, 
        timeoff varchar(10),
        timeres varchar(10),
        times_id varchar(2),
        unit varchar(5),
        value varchar(10),
        referencetime datetime not null,
        source_id varchar(20) not null,
        primary key(referencetime, source_id)
    )
"""
cur.execute(query)

In [28]:
folder = f'{cwd}//src//weather_csvs//'

for file in os.listdir(folder):
    if file.split('.')[-1] != 'csv': continue
    file_path = os.path.join(folder, file)
    
    query = f"""
        load data infile '{file_path}'
        into table Weather_Gathered
        fields terminated by ',' 
        enclosed by '"'
        lines terminated by '\r\n'
        ignore 1 rows  
    """
    cur.execute(query)

In [29]:
query = """
    select *
    from Weather_Gathered
    limit 3
"""
pd.read_sql(query, conn)

,a,b,element_id,c,level,perf,d,timeoff,timeres,times_id,unit,value,referencetime,source_id
0,0,0,max(air_temperature PT1H),2,"{'levelType': 'height_above_ground', 'unit': '...",C,0,PT0H,PT1H,0,degC,-0.3,2018-01-01,SN35210:0
1,0,0,max(air_temperature PT1H),2,"{'levelType': 'height_above_ground', 'unit': '...",C,0,PT0H,PT1H,0,degC,6.9,2018-01-01,SN36200:0
2,0,0,max(air_temperature PT1H),2,"{'levelType': 'height_above_ground', 'unit': '...",C,0,PT0H,PT1H,0,degC,4.1,2018-01-01,SN36330:0

In [30]:
query = """
    drop table if exists Dim_Weather
"""
cur.execute(query)

query = """
    create table Dim_Weather as (
        select 
            referencetime as time,
            trim(trailing ':0' from source_id) as weather_station,
            value as temperature
        from Weather_Gathered
    )
"""
cur.execute(query)

query = """
    alter table Dim_Weather
    add primary key(time, weather_station)
"""
cur.execute(query)

In [31]:
query = """
    select 
        weather_station,
        count(*)
    from Dim_Weather
    group by weather_station
"""
pd.read_sql(query, conn).T

,0,1,2,3,4,5,6,7,8,9,10
weather_station,SN35210,SN36200,SN36330,SN38140,SN39040,SN39750,SN40880,SN41090,SN41770,SN41825,SN42940
count(*),18960,18912,18545,18960,18923,18960,16162,18960,18921,18960,18960

In [32]:
query = """
    select *
    from Dim_Weather
    where time like '%2020-01%'
    limit 3
"""
pd.read_sql(query, conn)

        time weather_station temperature
0 2020-01-01         SN35210         4.7
1 2020-01-01         SN36200         7.3
2 2020-01-01         SN36330         5.3

In [33]:
query = """
    drop table if exists Facts
"""
cur.execute(query)

query = """
    create table Facts
    as(
        select 
            bel.time as time,
            date(bel.time) as day,
            bel.loc_id,
            s.nearest_station as weather_station,
            bel.consumption_kvah
        from Belastning_Gathered bel 
        left join
        (
            select 
                m.loc_id as loc_id,
                mns.nearest_station
            from 
                Dim_Municipality m,
                Municipality_Nearest_Station mns
            where m.municipality = mns.municipality
        ) s
        on bel.loc_id = s.loc_id  
    )
"""
cur.execute(query)

In [34]:
query = """
    select *
    from Facts
    where loc_id = 3
    limit 3
"""
pd.read_sql(query, conn)

                 time         day  loc_id weather_station consumption_kvah
0 2018-01-01 00:00:00  2018-01-01       3         SN39750             18.5
1 2018-01-01 01:00:00  2018-01-01       3         SN39750               20
2 2018-01-01 02:00:00  2018-01-01       3         SN39750             20.5

In [35]:
query = """
    select count(*)
    from Facts
"""
pd.read_sql(query, conn)

   count(*)
0    328448

## Sample queries

i.  Find the top five locations with the highest average consumption and their municipality.

In [36]:
query = """
    with a as (
        select 
            f.loc_id,
            avg(consumption_kvah) as avg_con,
            municipality,
            rank() over (
                order by avg(consumption_kvah) desc
            ) con_rank
            
        from Facts f
            left join Dim_Municipality m on f.loc_id = m.loc_id
        group by f.loc_id
    )
    select
        loc_id,
        municipality,
        avg_con,
        con_rank
        
        from a
        
        having con_rank <= 5
        
"""
pd.read_sql(query, conn)

   loc_id  municipality     avg_con  con_rank
0      13  Kristiansand  208.785168         1
1      12       Arendal  160.674683         2
2       7      Gjerstad  154.912478         3
3       9       Arendal  153.421721         4
4       1       Arendal  119.152032         5

ii. For those five, what was the mean temperature, oil price and el spot price at their day in 2019 of maximum consumption?

In [37]:
query = """
    with a as (
        select 
            f.loc_id,
            avg(consumption_kvah) as avg_con,
            avg(temperature) as avg_temp,
            avg(o.price) as avg_oilspot,
            avg(e.price) as avg_elspot,
            f.day,
            rank() over (
                partition by f.loc_id
                order by avg(consumption_kvah) desc
            ) con_rank 
            
        from Facts f
            left join Dim_Weather w on (w.time = f.time and w.weather_station = f.weather_station)
            left join Dim_Oilspot o on o.day = f.day
            left join Dim_Elspot e on e.time = f.time
            
        where 
            extract(year from f.time) = 2019 and
            f.loc_id in (1, 7, 9, 12 ,13)
        
        group by 
            f.day,
            f.loc_id
    )
    
    select * 
    from a
    having con_rank = 1  
    limit 10
    
        
"""
pd.read_sql(query, conn)

,loc_id,avg_con,avg_temp,avg_oilspot,avg_elspot,day,con_rank
0,1,214.216980,1.975000,62.46,528.500000,2019-01-31,1
1,7,410.751933,-13.587500,60.98,598.500000,2019-01-29,1
2,9,269.525116,-2.991667,59.71,539.875000,2019-01-28,1
3,12,261.748061,2.250000,64.50,420.083333,2019-11-29,1
4,13,259.164102,22.350000,62.29,380.333333,2019-07-29,1

Did anyone exceed the tolerance of their transformer?

In [38]:
query = """
    select 
        f.loc_id,
        time,
        consumption_kvah,
        upper_tol_kvah
        
    from 
        Facts f left join Dim_Transformer t on f.loc_id = t.loc_id
    where cast(consumption_kvah as decimal) > cast(upper_tol_kvah as decimal)
    limit 20
"""
pd.read_sql(query, conn)

   loc_id                time  consumption_kvah upper_tol_kvah
0       2 2018-12-12 08:00:00  118.651801503391            100
1       2 2018-12-24 14:00:00  106.169675519896            100
2       2 2018-12-24 16:00:00  102.122475488993            100
3       2 2018-12-24 17:00:00  104.576527002956            100
4       2 2018-12-24 18:00:00  106.617306287488            100
5       2 2019-01-27 21:00:00   100.62430123981            100
6       2 2019-10-27 02:00:00  107.557775823303            100

Apparently loc_id 2 did on Christmas Eve 2018 and later in January!

### Join all interesting data to output table

In [39]:
query = """
    select
        f.time as time,
        f.loc_id as location_id,
        consumption_kvah as el_consumption,
        w.temperature as degC,
        o.price as oil_price,
        e.price as el_price,
        usd.price_1_USD as price_1_USD
        
    from Facts f
    left join Dim_Weather w on (f.time=w.time and f.weather_station=w.weather_station) 
    left join Dim_Oilspot o on (f.day=o.day)
    left join Dim_Elspot e on (f.time=e.time)
    left join Dim_USD_NOK usd on (f.day = usd.day)
"""
df = pd.read_sql(query, conn)

In [40]:
df.shape

(328448, 7)

In [41]:
df.head()

        time  location_id el_consumption  degC oil_price el_price price_1_USD
0 2018-01-02            0             23   3.8     66.65   253,79      8.1435
1 2018-01-02            1            156   4.4     66.65   253,79      8.1435
2 2018-01-02            3             20   1.4     66.65   253,79      8.1435
3 2018-01-02            4             84  -1.6     66.65   253,79      8.1435
4 2018-01-02            6             41   2.3     66.65   253,79      8.1435

In [42]:
conn.close()
cur.close()

True